<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>runner</string>
		<key>creation_date</key>
		<date>2023-05-02T18:51:08Z</date>
		<key>munki_version</key>
		<string>6.2.1.4545</string>
		<key>os_version</key>
		<string>12.6.5</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>test</string>
	</array>
	<key>category</key>
	<string>Development</string>
	<key>description</key>
	<string>Manage your JetBrains tools easily. Save time and effort maintaining your IDEs, by downloading a patch or a set of patches instead of the full package download. Everything updates in the background while you never stop coding.</string>
	<key>developer</key>
	<string>JetBrains s.r.o.</string>
	<key>display_name</key>
	<string>JetBrains Toolbox</string>
	<key>installer_item_hash</key>
	<string>868fc087d98fb320a789ddf3e8ca073433dd702930b43302bf6cc7a0364db9aa</string>
	<key>installer_item_location</key>
	<string>JetBrainsToolbox-mac-1.28.0.15158.dmg</string>
	<key>installer_item_size</key>
	<integer>65393</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.jetbrains.toolbox</string>
			<key>CFBundleName</key>
			<string>JetBrains Toolbox</string>
			<key>CFBundleShortVersionString</key>
			<string>1.28.0.15158</string>
			<key>CFBundleVersion</key>
			<string>1.28.0.15158</string>
			<key>minosversion</key>
			<string>10.13.0</string>
			<key>path</key>
			<string>/Applications/JetBrains Toolbox.app</string>
			<key>type</key>
			<string>application</string>
			<key>version_comparison_key</key>
			<string>CFBundleShortVersionString</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>JetBrains Toolbox.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.13.0</string>
	<key>name</key>
	<string>JetBrainsToolbox</string>
	<key>supported_architectures</key>
	<array>
		<string>x86_64</string>
	</array>
	<key>unattended_install</key>
	<true/>
	<key>unattended_uninstall</key>
	<true/>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.28.0.15158</string>
</dict>
</plist>
